import streamlit as st

st.title("about")
st.write("web制作、アプリ開発、データ収集・分析に興味があります。農産物の通販サイト作成が非常に興味があります。"
         "世界中の方に使っていただけるアプリを制作していきたいです。")
st.markdown("""
## profile
name:田口　慎也
\nage:29
\njob:晴れの国岡山農業協同組合 (農産部門担当)
""")

st.markdown("""
## my history
・2023年9月よりプログラミング言語pythonについて学習開始。
\npythonを選択した理由はコードがシンプルでリリースの豊富さなど学習しやすいと感じたからです。さらにフレームワークを使う際に
汎用性があり学習するのに最適だと考え選択しました。
\n・10月よりwebスクレイピングを行いhtmlの中身を解析し構造を把握するようにしました。htmlからデータを抽出・加工しExcelやcsvに出力
する学習を行いました。
\n・フレームワークstreamlitを使い簡単な自己紹介HPを制作いたしました。
\n・djangoやflaskなどのフレームワークの学習をしておりますが制作には至っておりません。""")
